In [1]:
import pandas as pd

In [2]:
#check pandas version
pd.__version__

'1.0.1'

In [10]:
#create a pandas series
pd.Series()

'''pd.Series(
    data=None,
    index=None,
    dtype=None,
    name=None,
    copy=False,
    fastpath=False,
)
'''
a = pd.Series([1,2,3,4,5],dtype=float,index = range(1,6))
a

C:\Users\Hp\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [14]:
#series through dictionary values
dict_ = {"day1":10,"day2":20,"day3":30}
b = pd.Series(dict_)
b

day1    10
day2    20
day3    30
dtype: int64

In [17]:
data = {'a':0,'b':1,'c':2}
df = pd.Series(data,index=['e','b','c'])
df

e    NaN
b    1.0
c    2.0
dtype: float64

In [18]:
a = pd.Series(10,index=[1,2,3,4])
a

1    10
2    10
3    10
4    10
dtype: int64

In [19]:
b = pd.Series([10,20],index = [1,2,3,4])
b

ValueError: Length of passed values is 2, index implies 4.

In [23]:
#repeat the series
#single value repeat(n)
s = pd.Series(10).repeat(5)
s


#multiple value repeat([n,m])

0    10
0    10
0    10
0    10
0    10
dtype: int64

In [26]:
y = pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
y

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [3]:
#accessing data from series

#by index
#s[3]
s = pd.Series([1,2,3,4,5])
    
print(s[3])

#by labeled index

#by multiple index

print(s[[3,4]])

4
3    4
4    5
dtype: int64

In [6]:
#some important functions of pandas series

ser = pd.Series([1,2,3,4,-5])
ser

0    1
1    2
2    3
3    4
4   -5
dtype: int64

In [7]:
ser.abs() #it does not work on strings

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
#aggregate

ser.agg([min,max,sum])

min   -5
max    4
sum    5
dtype: int64

In [14]:
ser2 = pd.Series([5,6,7,8,9])
ser.append(ser2).reset_index(drop=True)

0    1
1    2
2    3
3    4
4   -5
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [15]:
#astype
ser.astype('str')

0     1
1     2
2     3
3     4
4    -5
dtype: object

In [17]:
#between (left and right)

ser.between(2,3)

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [18]:
ser

0    1
1    2
2    3
3    4
4   -5
dtype: int64

In [21]:
#clip_lower and clip_upper()

ser.clip_lower(3)

AttributeError: 'Series' object has no attribute 'clip_lower'

In [22]:
#cumsum and cumprod

ser.cumsum()

0     1
1     3
2     6
3    10
4     5
dtype: int64

In [23]:
ser.cumprod()

0      1
1      2
2      6
3     24
4   -120
dtype: int64

In [24]:
ser.describe()

count    5.000000
mean     1.000000
std      3.535534
min     -5.000000
25%      1.000000
50%      2.000000
75%      3.000000
max      4.000000
dtype: float64

In [26]:
#drop(by indexes and labels)

'''
ser.drop(
    labels=None,
    axis=0,
    index=None,
    columns=None,
    level=None,
    inplace=False,
    errors='raise',
)'''

ser.drop(index=[1,2])

0    1
3    4
4   -5
dtype: int64

In [27]:
#dropna fillna drop_duplicates isna/isnull()  to_list,to_frames

In [3]:
#Dataframe

'''
pd.DataFrame(
    data=None,
    index: Union[Collection, NoneType] = None,
    columns: Union[Collection, NoneType] = None,
    dtype: Union[str, numpy.dtype, ForwardRef('ExtensionDtype'), NoneType] = None,
    copy: bool = False,
)
'''

data = {
    'name':['rohan','rajat','rohan'],
    'age':[23,25,27]
}
df = pd.DataFrame(data)

In [35]:
#creating using list of lists

data = [['tom',10],['jerry',20]]
df = pd.DataFrame(data,columns=['name','marks'])
df

    name  marks
0    tom     10
1  jerry     20

In [36]:
data = [{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df = pd.DataFrame(data)
df

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [38]:
#rename
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [6]:
#slicing loc and iloc
#label and integer / integer
#list of labels / list of integer
#[A:B] both included / B excluded
#loc[row_label,col_label] / iloc[row_pos,col_pos]

df.loc[:,['name']]

    name
0  rohan
1  rajat
2  rohan

In [9]:
df.iloc[[0,2],[0,1]]

    name  age
0  rohan   23
2  rohan   27

In [13]:
#all the rows where column two value greater than 20

df.loc[df['age']>25,:]

    name  age
2  rohan   27

In [14]:
#column deletion removes permanenetly
del df['age']

In [15]:
df

    name
0  rohan
1  rajat
2  rohan

In [16]:
df['age'] = [10,20,30]

In [17]:
df

    name  age
0  rohan   10
1  rajat   20
2  rohan   30

In [18]:
df.pop('age')#u can see the data is being dropped

0    10
1    20
2    30
Name: age, dtype: int64

In [19]:
#python functions
#pipe function - tablw wise
#apply function - row/column wise
#applymap function - element wise

data = {
    'one':[1,2,3,4],
    'two':[5,6,7,8]
}
df = pd.DataFrame(data)
df

   one  two
0    1    5
1    2    6
2    3    7
3    4    8

In [21]:
def add(n,m):
    return n+m

df.pipe(add,10)

   one  two
0   11   15
1   12   16
2   13   17
3   14   18

In [22]:
#apply

df.apply(lambda x : x.max() - x.min())

one    3
two    3
dtype: int64

In [23]:
df

   one  two
0    1    5
1    2    6
2    3    7
3    4    8

In [25]:
#reindex()

new_index = [0,1,'a','b']
df.reindex(new_index,fill_value=1)

   one  two
0    1    5
1    2    6
a    1    1
b    1    1

In [26]:
#rename

df.rename()

'''
df.rename(
    mapper=None,
    index=None,
    columns=None,
    axis=None,
    copy=True,
    inplace=False,
    level=None,
    errors='ignore',
)
'''

TypeError: must pass an index to rename

In [27]:
#pandas iteration

#iteritems() = key,value pair
#iterrows() - index,series
#itertuples() - over rows - original data as view

for key,value in df.iteritems():
    print(key,value)

one 0    1
1    2
2    3
3    4
Name: one, dtype: int64
two 0    5
1    6
2    7
3    8
Name: two, dtype: int64

In [28]:

for key,value in df.iterrows():
    print(key,value)

0 one    1
two    5
Name: 0, dtype: int64
1 one    2
two    6
Name: 1, dtype: int64
2 one    3
two    7
Name: 2, dtype: int64
3 one    4
two    8
Name: 3, dtype: int64

In [30]:

for key in df.itertuples():
    print(key)

Pandas(Index=0, one=1, two=5)
Pandas(Index=1, one=2, two=6)
Pandas(Index=2, one=3, two=7)
Pandas(Index=3, one=4, two=8)

In [31]:
#sorting with pandas

#sorted,   .sort    sort_values()   sort_index()

In [3]:
data = {
    'name':['arpit','manish','joy','rohit','virat','shreya'],
    'age':[30,35,37,33,34,30],
    'salary':[100000,93000,88000,120000,94000,95000],
    'Designation':['Engineer','Artist','Painter','Singer','Designer','Dancer']
}

df = pd.DataFrame(data)
df

     name  age  salary Designation
0   arpit   30  100000    Engineer
1  manish   35   93000      Artist
2     joy   37   88000     Painter
3   rohit   33  120000      Singer
4   virat   34   94000    Designer
5  shreya   30   95000      Dancer

In [33]:
#display the name and age of employees where salary is less than mean salary

df.loc[df['salary'] < df['salary'].mean(),['name','age']]

     name  age
1  manish   35
2     joy   37
4   virat   34
5  shreya   30

In [38]:
#display the name and age of employees where salary > 100000 and age is less than 40

df.loc[(df['salary']>100000) & (df['age']<40) ,['name','age']]

    name  age
3  rohit   33

In [39]:
#create a new column salary_after5 where salary increased by factor of 1.5
def salry(n):
    return n*1.5

new_sal = df['salary'].apply(salry)
df['salary_after5'] = new_sal
df

     name  age  salary Designation  salary_after5
0   arpit   30  100000    Engineer       150000.0
1  manish   35   93000      Artist       139500.0
2     joy   37   88000     Painter       132000.0
3   rohit   33  120000      Singer       180000.0
4   virat   34   94000    Designer       141000.0
5  shreya   30   95000      Dancer       142500.0

In [40]:
#or u can use insert 
#df.insert()
#Signature: df.insert(loc, column, value, allow_duplicates=False) -> None

In [43]:
#display 60th and 95th percentile values from describe functions

df.describe(percentiles=[0.60,0.95])

             age         salary  salary_after5
count   6.000000       6.000000       6.000000
mean   33.166667   98333.333333  147500.000000
std     2.786874   11290.113669   16935.170504
min    30.000000   88000.000000  132000.000000
50%    33.500000   94500.000000  141750.000000
60%    34.000000   95000.000000  142500.000000
95%    36.500000  115000.000000  172500.000000
max    37.000000  120000.000000  180000.000000

In [48]:
#display the top 2 salaries and names

df = df.sort_values(by='salary',ascending = False)
df.loc[:,['name','salary']].head(2).reset_index(drop=True)

    name  salary
0  rohit  120000
1  arpit  100000

In [2]:
#groupby

#splitting the data in groups
#applying aggregate functions

#df.groupby(key)
#df.groupby([key1,key2])
#df.groupby(key,axis=1)

#selecting a particular group get_group()

df.groupby()

In [ ]:
'''
pd.read_csv(
    filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]],
    sep=',',
    delimiter=None,
    header='infer',
    names=None,
    index_col=None,
    usecols=None,
    squeeze=False,
    prefix=None,
    mangle_dupe_cols=True,
    dtype=None,
    engine=None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace=False,
    skiprows=None,
    skipfooter=0,
    nrows=None,
    na_values=None,
    keep_default_na=True,
    na_filter=True,
    verbose=False,
    skip_blank_lines=True,
    parse_dates=False,
    infer_datetime_format=False,
    keep_date_col=False,
    date_parser=None,
    dayfirst=False,
    cache_dates=True,
    iterator=False,
    chunksize=None,
    compression='infer',
    thousands=None,
    decimal: str = '.',
    lineterminator=None,
    quotechar='"',
    quoting=0,
    doublequote=True,
    escapechar=None,
    comment=None,
    encoding=None,
    dialect=None,
    error_bad_lines=True,
    warn_bad_lines=True,
    delim_whitespace=False,
    low_memory=True,
    memory_map=False,
    float_precision=None,
)
'''
pd.read_csv()